// Задача 3*: Задача 1: Заполните спирально квадратный массив по возрастанию, с заданным размером:

// Console.Clear(); 

// int i = 10;
// while (i > 0) Console.WriteLine(i--);