// Задача 2: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 3, n = 2 -> A(m,n) = 29

// Console.Clear(); 
 
//  Console.Write("Введите число N: "); 
//  int countN = Convert.ToInt32(Console.ReadLine()); 
//  Sequence(countN); 
 
//  void Sequence(int count, int number = 0, int countnum = 0){ 
//     if (count == 0) return; 
//     for (int i = 0; countnum < count; i++)
//     { 
//         countnum = countnum + i; 
//         number = i; 
//     } 
//     Sequence(--count); 
//     Console.Write(number + " "); 
//  }